IDENTIFICATION DIVISION.
PROGRAM-ID. CAESAR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-TEXT PIC A(99).
01 WS-MOVE PIC 999.

01 WS-TEXT2 PIC A(99) VALUE "BPQA QA I BMAB ABZQVO NZWU ITIV".

01 WS-TEXT3 PIC A(99) VALUE "IBM".
01 WS-SOLV PIC A(99) VALUE 26.

PROCEDURE DIVISION.

MOVE "This is a test string from Alan" TO WS-TEXT.
SET WS-MOVE TO 8.

CALL 'SOLVE' USING WS-TEXT3, WS-SOLV.
CALL 'ENCRYPT' USING WS-TEXT, WS-MOVE.
CALL 'DECRYPT' USING WS-TEXT2, WS-MOVE.

STOP RUN.

END PROGRAM CAESAR.

IDENTIFICATION DIVISION.
PROGRAM-ID. ENCRYPT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MSG PIC A(99).
01 WS-CIPHER PIC A(99).
01 WS-COUNT PIC 999 VALUE 1.
01 WS-SPACE PIC 999 VALUE 1.
01 WS-ASCII PIC 999.

LINKAGE SECTION.
01 LS-TEXT PIC A(99).
01 LS-SHIFT PIC 999.
PROCEDURE DIVISION USING LS-TEXT, LS-SHIFT.

MAIN.
MOVE FUNCTION UPPER-CASE(LS-TEXT) TO WS-MSG.
PERFORM SHIFT-LOOP WITH TEST BEFORE UNTIL WS-COUNT > FUNCTION LENGTH(FUNCTION TRIM(WS-MSG)).

DISPLAY WS-CIPHER.

STOP RUN.

SHIFT-LOOP.

SET WS-ASCII TO FUNCTION ORD(WS-MSG(WS-COUNT:1)).

IF WS-MSG(WS-COUNT:1) NOT= " " THEN
ADD FUNCTION MOD(LS-SHIFT, 26) TO WS-ASCII.

*> NESTED LOOP WAS NOT WORKING SO I HAD TO DO THIS INSTEAD
IF WS-ASCII > FUNCTION ORD("Z") and FUNCTION CHAR(WS-ASCII) NOT = " " THEN
SUBTRACT 26 FROM WS-ASCII.

SET WS-SPACE TO WS-COUNT
STRING
FUNCTION CHAR(WS-ASCII)
INTO WS-CIPHER
WITH POINTER WS-SPACE
END-STRING.

ADD 1 TO WS-COUNT.

SEC. *> NEEDED TO INCLUDE THIS HERE BECUASE THE LOOPS WERENT WORKING DUE TO THEM NOT KNOWING WHERE THE SECTION ENDS
END PROGRAM ENCRYPT.


IDENTIFICATION DIVISION.
PROGRAM-ID. DECRYPT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-COUNT PIC 999 VALUE 0.
01 WS-TEMP PIC 999 VALUE 26.
LINKAGE SECTION.
01 LS-TEXT PIC A(99).
01 LS-SHIFT PIC 999.
PROCEDURE DIVISION USING LS-TEXT, LS-SHIFT.

MAIN.
DISPLAY "HERE"
SUBTRACT LS-SHIFT FROM WS-TEMP.
CALL 'ENCRYPT' USING LS-TEXT, WS-TEMP.

END PROGRAM DECRYPT.



IDENTIFICATION DIVISION.
PROGRAM-ID. SOLVE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MSG PIC A(99).
01 WS-COUNT PIC 999 VALUE 0.

LINKAGE SECTION.
01 LS-TEXT PIC A(99).
01 LS-VAL PIC 999.
PROCEDURE DIVISION USING LS-TEXT, LS-VAL.

MAIN.
MOVE FUNCTION UPPER-CASE(LS-TEXT) TO WS-MSG.
PERFORM LOOP WITH TEST BEFORE UNTIL WS-COUNT > LS-VAL.

STOP RUN.

LOOP.
DISPLAY "Caesar " WS-COUNT ": ".
CALL 'ENCRYPT' USING WS-MSG, WS-COUNT.
ADD 1 TO WS-COUNT.


SEC. *> NEEDED TO INCLUDE THIS HERE BECAUSE THE LOOPS WERE NOT WORKING DUE TO THEM NOT KNOWING WHERE THE SECTION ENDS
END PROGRAM SOLVE.
